Tekla Open API Reference for Tekla Structures 2025
Frame Class
 The Frame class defines a frame that can be given to objects, including texts. A frame is a box around the object. You can specify the color and shape of the box.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.Frame
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Frame : IAxisAlignedBoundingBox,
	IObjectAlignedBoundingBox, IIsEqual, ICloneable
<SerializableAttribute>
Public NotInheritable Class Frame
	Implements IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IIsEqual, ICloneable
The Frame type exposes the following members.
Constructors
Name | Description
Frame(FrameTypes, DrawingColors)
 Creates a new frame instance with the specified frame type and color.
Frame(FrameTypes, TeklaDrawingColor)
 Creates a new frame instance with the specified frame type and RGB color.
Top
Properties
Name | Description
Color
 The frame's color.
TrueColor
 The true color (RGB enabled) of the frame.
Type
 The frame's type (square, round, dashed...).
Top
Methods
Name | Description
Clone
 Clones the object.
GetAxisAlignedBoundingBox
 Returns the bounding box of the frame in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Returns the bounding box of the frame in the local coordinate system.
IsEqual
 Compares the current object with an object of the same type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace